//Синтаксис async/await

//#region Асинхронні функції

//Синтаксис async/await — це зручний спосіб написання асинхронного коду, який виглядає схожим на синхронний. Цей підхід був доданий у стандарт ECMAScript 2017 (ES8) і став популярним серед розробників завдяки простоті та зрозумілості.

//Будь-яка функція може бути асинхронною, якщо перед її оголошенням додати ключове слово async.

// Для оголошення асинхронної функції перед ключовим словом function додається async.
async function fetchData() {
  // ...
}

//У функціональному виразі також перед ключовим словом function додається async.
{
  const fetchData = async function () {
    // ...
  };
}

//Для оголошення асинхронної стрілкової функції перед списком параметрів додається ключове слово async.
{
  const fetchData = async () => {
    // ...
  };
}

//Для оголошення асинхронного методу об'єкта async додається перед іменем методу.
const user = {
  async getUsername() {
    // ...
  },
};

//Для оголошення асинхронного методу об'єкта async додається перед іменем методу.
{
  const user = {
    async getUsername() {
      // ...
    },
  };
}

//Для оголошення асинхронного методу класу також використовується async перед іменем методу.
{
  class User {
    async getUsername() {
      // ...
    }
  }
}

//Асинхронні функції дозволяють працювати з await, що робить код чистішим та легшим для розуміння, усуваючи необхідність у вкладених .then().
//#endregion
