//Синтаксис async/await

//#region Асинхронні функції

//Синтаксис async/await — це зручний спосіб написання асинхронного коду, який виглядає схожим на синхронний. Цей підхід був доданий у стандарт ECMAScript 2017 (ES8) і став популярним серед розробників завдяки простоті та зрозумілості.

//Будь-яка функція може бути асинхронною, якщо перед її оголошенням додати ключове слово async.

// Для оголошення асинхронної функції перед ключовим словом function додається async.
async function fetchData() {
  // ...
}

//У функціональному виразі також перед ключовим словом function додається async.
{
  const fetchData = async function () {
    // ...
  };
}

//Для оголошення асинхронної стрілкової функції перед списком параметрів додається ключове слово async.
{
  const fetchData = async () => {
    // ...
  };
}

//Для оголошення асинхронного методу об'єкта async додається перед іменем методу.
const user = {
  async getUsername() {
    // ...
  },
};

//Для оголошення асинхронного методу об'єкта async додається перед іменем методу.
{
  const user = {
    async getUsername() {
      // ...
    },
  };
}

//Для оголошення асинхронного методу класу також використовується async перед іменем методу.
{
  class User {
    async getUsername() {
      // ...
    }
  }
}

//Асинхронні функції дозволяють працювати з await, що робить код чистішим та легшим для розуміння, усуваючи необхідність у вкладених .then().
//#endregion

//#region Значення, що повертається

//Синтаксис async/await базується на промісах, тому не блокує основний потік виконання програми. Це альтернатива підходу з then/catch для роботи з асинхронним кодом.

/* 
Що повертає асинхронна функція?

Завжди повертає проміс.
Якщо функція повертає значення, воно обгортається в проміс.
Якщо не повертає значення, створюється проміс із undefined.
 */

//Отже, будь-яке значення, що повертається з функції, стане значенням проміса.
{
  const foo = async () => {
    return 5;
  };

  foo().then((value) => {
    console.log(value); // 5
  });
  //Функція foo() повертає 5, але фактично це Promise.resolve(5).
}

//Якщо не вказувати значення для повернення, буде створений проміс зі значенням undefined.
{
  const foo = async () => {
    // Не вказуємо значення для повернення
  };

  foo().then((value) => {
    console.log(value); // undefined
  });
}
// Оскільки нічого не повертається, результатом буде Promise.resolve(undefined).
// Асинхронні функції спрощують роботу з промісами, дозволяючи уникнути вкладених .then() і роблячи код читабельнішим.
//#endregion

//#region Оператор await

// Оператор await використовується всередині асинхронних функцій (async) для очікування завершення промісу перед тим, як виконання коду продовжиться.

//#endregion
