//Синтаксис spread і rest

//#region rest Залишкові параметри
// Ми вже знаємо, що викликати функцію можна з будь-якою кількістю аргументів незалежно від того, як її було визначено. Зайві аргументи не викличуть помилку.
{
  function multiply(a, b) {
    console.log(a, b);
  }

  multiply(1, 2); // 1 2
  multiply(1, 2, 3); // 1 2
  multiply(1, 2, 3, 4); // 1 2
}

//У прикладі вище проблема в тому, що аргументів більше, ніж параметрів. І будуть використані лише перші два аргументи — за кількістю оголошених параметрів.
// Ми вже вміємо розв'язувати такі завдання, використовуючи псевдомасив arguments, у який збираються всі передані аргументи.
{
  function multiply() {
    console.log(arguments);
  }

  multiply(1, 2); // псевдомасив [1, 2]
  multiply(1, 2, 3); // псевдомасив [1, 2, 3]
  multiply(1, 2, 3, 4); // псевдомасив [1, 2, 3, 4]
}

//Починаючи зі стандарту ES6, з'явилася концепція залишкових параметрів (...rest). Це спеціальний синтаксис, який дозволяє зібрати групу незалежних елементів у масив.
{
  function multiply(...args) {
    console.log(args);
  }

  multiply(1, 2); // [1, 2]
  multiply(1, 2, 3); // [1, 2, 3]
  multiply(1, 2, 3, 4); // [1, 2, 3, 4]
}

//Приклад
// Використовуючи синтаксис залишкових параметрів, доповни код функції add() так, щоб вона приймала будь-яку кількість аргументів у параметр args і повертала їхню суму.

{
  function add(...args) {
    let sum = 0;

    for (const arg of args) {
      sum += arg; // додаємо поточне значення до суми
    }

    return sum;
  }

  console.log(add(1, 2, 3, 4));
}
//#endregion

//#region rest Збір частини аргументів
// Операція (...rest) також дозволяє зібрати в масив тільки ту частину аргументів, яка необхідна. Для цього потрібно оголосити параметри до «збирання». Можна покласти перші кілька параметрів у змінні, а решту — зібрати в масив.
{
  function multiply(first, second, ...args) {
    console.log(first, second, args);
  }

  multiply(1, 2); // 1 2
  multiply(1, 2, 3); // 1 2 [3]
  multiply(1, 2, 3, 4); // 1 2 [3, 4]
}

//Усі аргументи, для яких будуть оголошені параметри, передадуть їм свої значення, інші аргументи міститимуться в масиві.
// У параметр first буде поміщено перший аргумент
// У параметр second буде поміщено другий аргумент
// У параметр args буде поміщено масив з інших аргументів

// Операція rest збирає решту всіх аргументів, а тому повинна завжди бути останньою в підписі функції, інакше виникне помилка SyntaxError: Rest parameter must be last formal parameter. Це викличе помилки:

//function multiply(first, ...args, second) {}
//function multiply(...args, first, second) {}

//Приклад
// Функція addOverNum() приймає довільну кількість аргументів чисел.
// Доповни код функції таким чином, щоб вона обчислювала суму тільки тих аргументів, які більші за задане число. Це число завжди буде передано першим аргументом.
// Для вирішення цього завдання тобі потрібно зробити наступне:
// Перший параметр value повинен представляти задане число, а решта аргументів повинні бути зібрані за допомогою синтаксису (...args)
// Усередині функції ініціалізуй змінну для зберігання загальної суми
// Потім пройдись по кожному аргументу за допомогою циклу
// Перевір, чи кожен аргумент більший за вказане число, і якщо так, додай його до загальної суми
// На завершення поверни загальну суму

{
  function addOverNum(value, ...args) {
    let total = 0;
    for (const arg of args) {
      if (arg > value) {
        total += arg;
      }
    }
    return total;
  }
  console.log(addOverNum(50, 15, 27)); // 0
  console.log(addOverNum(10, 12, 4, 11, 48, 10, 8)); // 71
  console.log(addOverNum(15, 32, 6, 13, 19, 8)); // 51
  console.log(addOverNum(20, 74, 11, 62, 46, 12, 36)); // 137
}
//#endregion

//#region spread Входження параметрів
// Ти вже знаєш, як отримати масив зі списку аргументів.
// Інколи потрібно зробити протилежне — передати масив поелементно у функцію, яка викликається. Наприклад, є вбудована функція Math.max(), яка шукає та повертає найбільший з аргументів (чисел), тобто очікує не масив значень, а довільну кількість аргументів.

//#endregion
