// Метод toSorted

//#region Метод toSorted()

// Метод toSorted() сортує елементи масиву.
// Сортує вихідний масив
// Повертає новий масив
// За замовчуванням сортує за зростанням

//#region Масив чисел
// Розгляньмо приклад, де потрібно відсортувати масив scores.
// Вихідний масив scores залишається незмінним. Новий масив ascendingScores містить масив чисел, що відсортований за зростанням.

{
  const scores = [61, 19, 74, 35, 92, 56];
  const ascendingScores = scores.toSorted();

  console.log(scores); // [61, 19, 74, 35, 92, 56]
  console.log(ascendingScores); // [19, 35, 56, 61, 74, 92]
}

//Оскільки за замовчуванням перед сортуванням метод toSorted() приводить усі елементи масиву до рядків, то фактично елементи сортуються як рядки, тобто на основі їхніх значень у таблиці Unicode. Стандартне сортування чисел виглядає незвично, коли ми думаємо про числа, але зрозуміло, якщо знати, що числа були перетворені на рядки.
{
  const scores = [27, 2, 41, 4, 7, 3, 75];

  console.log(scores.toSorted()); // [2, 27, 3, 4, 41, 7, 75]
}
//При такому сортуванні рядки порівнюються за символами зліва направо, тобто спочатку порівнюються рядки 2 і 27. Перший символ 2 у них однаковий, але рядок 2 містить лише 1 символ, тому він менший, ніж рядок 27, і йде першим.
// Потім порівнюються рядки 27 і 3. Перший символ у рядку 3 більший за перший символ 2 у рядку 27, тому 3 йде після 27.

//#endregion

//#region Масив рядків
// Масив рядків сортується за алфавітом.
{
  const students = ["Jacob", "Artemis", "Solomon", "Adrian", "Kai", "Ganymede"];

  console.log(students.toSorted()); // [ "Adrian", "Artemis", "Ganymede", "Jacob", "Kai", "Solomon" ]
}

//Водночас порядковий номер великих літер менший, ніж у малих.
{
  const letters = ["b", "B", "a", "A", "c", "C"];

  console.log(letters.toSorted()); // ["A", "B", "C", "a", "b", "c"]
}

//Task

// Змінна releaseDates - це масив чисел, років видання книг. Змінна authors - це масив рядків, авторів книг.
// Доповни код таким чином, щоб у змінній ascendingReleaseDates вийшла копія масиву releaseDates, відсортована за зростанням, а у змінній alphabeticalAuthors - копія масиву імен авторів authors, відсортована за алфавітом. Використовуй метод toSorted()
{
  const releaseDates = [2016, 1967, 2008, 1984, 1973, 2012, 1997];
  const authors = [
    "Tanith Lee",
    "Bernard Cornwell",
    "Robert Sheckley",
    "Edgar Allan Poe",
  ];

  const ascendingReleaseDates = releaseDates;

  const alphabeticalAuthors = authors;
}

//#endregion
