//Стрілочні функції

//#region Стрілочні функції: синтаксис
// Стрілочні функції (сленг — “стрілки”) мають скорочений, лаконічніший синтаксис, що зменшує обсяг коду, особливо коли функція маленька або якщо вона використовується як колбек.
// Усі стрілки створюються як функціональний вираз, і їх необхідно присвоювати змінній.

{
  // Звичайне оголошення функції
  function classicAdd(a, b, c) {
    return a + b + c;
  }

  // Те саме стрілочною функцією
  const arrowAdd = (a, b, c) => {
    return a + b + c;
  };
}

//Ключове слово function не використовується
// Одразу зазначається оголошення параметрів
// Після параметрів використовується символ => і тіло функції у фігурних дужках

{
  //Якщо параметрів декілька, то вони перераховуються через кому в круглих дужках, між знаками рівності = і стрілкою =>.

  const add = (a, b, c) => {
    return a + b + c;
  };
}

{
  //Якщо параметр один, його можна оголошувати без круглих дужок.

  const add = (a) => {
    return a + 5;
  };
}

{
  //Якщо параметри відсутні, то обов'язково повинні бути порожні круглі дужки.

  const greet = () => {
    console.log("Hello!");
  };
}

{
  //Task
  // Виконай рефакторинг функції calculateTotalPrice() таким чином, щоб вона була оголошена як стрілочна.

  const calculateTotalPrice = (quantity, pricePerItem) => {
    return quantity * pricePerItem;
  };
}
//#endregion

//#region Неявне повернення
// У стрілочної функції після символу => знаходиться її тіло. Існує два способи запису: з фігурними дужками і без них.

{
  //Запис із фігурними дужками
  // Якщо є фігурні дужки і функція повинна повертати якесь значення, необхідно явно поставити return. Це називається явне повернення (explicit return).
  const add = (a, b, c) => {
    console.log(a, b, c);
    return a + b + c;
  };

  //Такий синтаксис використовується в тому випадку, якщо в тілі функції потрібно виконати ще якісь інструкції, окрім повернення значення.
}

{
  //Запис без фігурних дужок
  // Якщо фігурні дужки відсутні, то повертається результат виразу, який стоїть після =>. Це називається неявне повернення (implicit return). У прикладі повернеться результат виразу додавання параметрів a, b і c.

  const add = (a, b, c) => a + b + c;
}

//#endregion
