//Вебсховище

//#region Сookie;

// Скільки разів тобі зустрічалося спливаюче вікно на вебсайті з написом:
// Цей вебсайт використовує файли cookie для зберігання вашої інформації.

// Скоріш за все, так часто, що можна збитися з рахунку!

// Свого часу вебсайти використовували протокол HTTP без збереження стану. Це означало, що вони не могли зберігати інформацію, пов’язану з користувачем, таку як ідентифікатор сеансу користувача, ім’я користувача, наповнення кошика товарів тощо, у веббраузері.

// З розвитком інтернету та його популярністю вебсайти почали зберігати інформацію, пов’язану з користувачем, у самому браузері. Це допомогло розрізняти тип користувача, який взаємодіє з їхнім вебсайтом, і забезпечити персоналізований досвід для користувача.

//Так з’явилися cookie (кукі). Вони надали механізм для зберігання невеликих фрагментів текстових даних клієнта або сервера у браузері як пари ключ-значення. Сookie також мають позначку часу закінчення терміну їх дії, після чого автоматично видаляються браузером.

// Браузер і сервер можуть установлювати та отримувати cookie з браузера користувача. Крім того, cookie можуть автоматично надсилатися разом із кожним HTTP-запитом на сервер. У результаті сервер може легко розпізнати інформацію користувача з кожним HTTP-запитом, який зробив користувач.

// Сookie використовуються й досі, але взаємодія з ними часто зводиться до встановлення та читання їх значень на сервері. Зазвичай це робиться за допомогою різних бібліотек, щоб спростити весь процес.

// Фронтенд рідко взаємодіє із вмістом cookie безпосередньо, оскільки вони можуть бути дещо обмеженими у використанні та мати обмежену ємність для зберігання даних. Щоб вирішити цю проблему, сучасні браузери мають власні механізми зберігання, такі як локальне сховище та сховище сеансів.

//#endregion

//#region Web Storage API

//Cookie розв'язують проблему збереження інформації на стороні користувача під час взаємодії з вебсайтами. Водночас вони мають деякі обмеження.
// По-перше, їхні можливості обмежуються зберіганням даних розміром лише до кількох кілобайт. З ростом складності клієнтських програм виникла потреба зберігати більш об'ємні та складні дані прямо у браузері.
// З появою HTML5 на вебсайтах з'явилося API зберігання даних у браузері для ефективного управління інформацією на стороні користувача. Таким чином, будь-який JavaScript-код, що запускається у браузері, може легко отримати доступ до цих API. Основна відмінність полягає в тому, що ці механізми надавали більший об'єм для зберігання даних і можуть бути доступні лише для JavaScript, що виконувався на боці клієнта.

//Вебсховище — це механізм у веббраузерах, який дозволяє вебдодаткам зберігати та отримувати дані на стороні клієнта, тобто на комп'ютері користувача. Щоразу, коли ти змінюєш тему кольорів між світлою і темною, переглядаєш відео, додаєш товар у кошик, відкриваєш або закриваєш сайдбар, популярні вебзастосунки можуть запам'ятовувати стан інтерфейсу і в наступному відвідуванні відновлювати його.
// Вебсховище не зберігає паролі, номери банківських карт та іншу конфіденційну інформацію. Якщо шкідливий скрипт отримає доступ до вебсторінки, він без проблем зможе прочитати ці дані.
// Вебсховище складається з локального сховища та сховища сеансів.
// Локальне сховище (Local Storage): унікальне для кожного вебдодатку і буде однаковим на кількох вкладках, де вебдодаток відкритий. Дані в локальному сховищі не видаляються, навіть після закриття браузера або вимкнення комп'ютера. Щоб їх видалити, потрібно використовувати JavaScript. Доступ до даних у локальному сховищі можливий з будь-якої вкладки або вікна браузера, пов'язаної з доменом, який створив дані.
// Сховище сесії (Session Storage): на відміну від локального сховища, дані у сховищі сесії зберігаються лише протягом одної сесії браузера. Якщо користувач закриє вкладку або браузер, дані будуть видалені. Сховище сесії зручне для зберігання тимчасових даних або станів, які не повинні зберігатися довгий час.

//#endregion

//#region Локальне сховище
// Дані в локальному сховищі зберігаються у JSON форматі під певним ключем. Цей ключ може бути тільки рядком, і значенням виступає будь-що, що дозволяється JSON форматом.
// Локальне сховище може зберігати дані розміром від 5 Мб до 10 Мб. Точний обсяг пам’яті залежить від реалізації кожного браузера, але це значно більше, ніж 4 Кб пам’яті, яку пропонують cookie.
// Дані в локальному сховищі не мають терміну зберігання за замовчуванням. Вони видаляються, лише якщо ти вручну видалиш ці дані з локального сховища безпосередньо, через налаштування браузера або за допомогою коду JavaScript. Це означає, що дані в локальному сховищі зберігаються навіть після закриття певної вкладки або вікна браузера. У кожного сайту своє окреме локальне сховище, тому збережені дані між сайтами не перетинаються.
// Доступ до локального сховища можна отримати в об’єкті window:

console.log(window.localStorage);
// Storage {length: 0}

//Це поверне довжину локального сховища разом з об’єктом, що представляє дані, які зараз присутні всередині. Оскільки спочатку він порожній, довжина дорівнює 0.
// Можна також отримати прямий доступ до об’єкта localStorage, адже за замовчуванням пошук відбувається на об’єкті window.

console.log(localStorage);
// Storage {length: 0}

//Завдяки тому, що дані в локальному сховищі не мають терміну зберігання за замовчуванням, цей тип сховища має цілу низку застосувань. Це всі ті сценарії, коли потрібно зберігати деякі глобальні дані, до яких часто звертаються у програмі.
// Наприклад, зміна теми кольорів між світлою і темною, перегляд відео, додавання товару в кошик, відкривання або закривання сайдбара, бажаний спосіб оплати користувача, адреси доставки за замовчуванням тощо, увесь цей стан інтерфейсу можливо зберегти і в наступному відвідуванні відновити його.

//#endregion

//#region Додавання даних
//Давай додамо пару ключ-значення до локального сховища за допомогою методу setItem(key, value), доступного в об’єкті localStorage:

//#endregion
