//#regionДеструктуризація масивів

// Деструктуризоване присвоювання можна використовувати не тільки для об’єктів, а й для масивів, але з деякими особливостями.
// Замість фігурних дужок {} використовуються квадратні [].
// Змінним, зазначеним у квадратних дужках [], будуть послідовно присвоюватися значення елементів масиву.
// Наприклад, є масив чисел. З нього потрібно отримати значення кожної складової кольору в окремих змінних.
{
  const color = [200, 255, 100];
  const [red, green, blue] = color;

  console.log(`rgb(${red}, ${green}, ${blue})`); // “rgb(200, 255, 100)"
}

//Після ключового слова const або let ставимо квадратні дужки, як і у випадку з оголошенням масиву. Всередині дужок, через кому, вказуємо імена змінних, у які будуть поміщені значення відповідних елементів масиву.
// Внаслідок такого запису будуть створені 3 змінні, і в них будуть поміщені елементи в нумерованому порядку: від 0 і до кінця масиву.

//#endregion

//#region Значення за замовчуванням
// Якщо змінних оголошено більше, ніж елементів масиву, їм буде присвоєно undefined. Щоб запобігти цьому, можна вказувати значення за замовчуванням.
{
  // Синтаксис такий самий, як в об'єктах, після імені змінної ставимо = і значення за замовчуванням.

  const color = [200, 100, 255];
  const [red, green, blue, alfa = 0.3] = color;

  console.log(`rgba(${red}, ${green}, ${blue}, ${alfa})`); // “rgba(200, 255, 100, 0.3)"
}
//#endregion

//#region Часткова деструктуризація
// Іноді з масиву необхідно деструктуризувати тільки перші N елементів, а інші зберегти в одну змінну у вигляді масиву.
// Деструктуризуючи масив, можна розпакувати перші необхідні елементи і присвоїти іншу частину елементів масиву змінній, використовуючи операцію ...rest.
{
  const color = [200, 255, 100];

  const [red, ...otherColors] = color;

  console.log(red); // 200
  console.log(otherColors); // [255, 100]
}

//При цьому оригінальний масив не змінюється, у змінній otherColor буде новий масив із копіями зібраних значень.
// З об'єктами, до речі, це теж працює. Можна деструктуризувати певні властивості в окремі змінні, а решту зібрати в новий об'єкт.
{
  const user = {
    name: "Jacob",
    age: 32,
    email: "j.cob@mail.com",
    isOnline: true,
  };

  const { name, isOnline, ...otherProps } = user;

  console.log(name); // "Jacob"
  console.log(isOnline); // true
  console.log(otherProps); // {age: 32, email: "j.cob@mail.com"}
}
//При цьому оригінальний об'єкт не змінюється, у змінній otherProps буде новий об'єкт із копіями зібраних властивостей.
//#endregion

//#region Пропуск значень
// На відміну від іменованих властивостей об'єкта, елементи масиву — це набір індексованих значень. Якщо необхідно деструктуризувати тільки, наприклад, третій елемент, перші два необхідно пропустити.
// Припустимо, з масиву color необхідно взяти тільки останнє значення. Для цього в деструктуризації необхідно відокремити комами елементи, що пропускаються.

{
  const rgb = [200, 100, 255];

  const [, , blue] = rgb;

  console.log(`Blue: ${blue}`); // "Blue: 255"
}
//На практиці в масивах ця можливість рідко використовується, але знати, що так можна робити, зайвим не буде.
// #endregion

//#region Деструктуризація параметрів
// Під час передачі масиву у функцію, можна деструктуризувати його елементи.
{
  function printFruits(fruits) {
    console.log(fruits[0], fruits[1], fruits[2]);
  }

  printFruits(["apple", "banana", "orange"]); // "apple banana orange"
}

//Із деструктуризацією в місці оголошення параметрів:
{
  function printFruits([firstFruit, secondFruit, thirdFruit]) {
    console.log(firstFruit, secondFruit, thirdFruit);
  }

  printFruits(["apple", "banana", "orange"]); // "apple banana orange"
}
// #endregion

//Переваги деструктуризації
//Давай підсумуємо переваги деструктуризації:

// Зручне вилучення значень з об'єктів і масивів: Замість того, щоб щоразу звертатися до полів об'єкта або елементів масиву за їхніми індексами або іменами, можна одразу витягти потрібні значення у змінні.

// Короткий і читабельний код: Деструктуризація робить код коротшим і зрозумілішим. Замість довгих виразів доступу до полів об'єктів або елементів масиву, можна відразу присвоїти значення змінним зі зрозумілими іменами.

// #Параметри функцій: При передачі об'єктів у функції, можна деструктуризувати об'єкти, щоб отримати доступ до потрібних даних. Це дозволяє явно вказати, які поля об'єкта використовуються у функції.

// Робота з функціями, що повертають об'єкти: Якщо функція повертає об'єкт, можна відразу деструктуризувати цей об'єкт, щоб витягти з нього значення.
