// Делегування подій
//#region Поширення подій

// Поширення подій (event propagation) — це термін, що описує життєвий цикл події, який має три етапи:
// Занурення (capture phase).
// Таргетинг (target phase).
// Спливання (bubble phase).

// На практиці найчастіше використовують тільки фазу спливання.

// Давайте розглянемо детальніше ці фази під час настання події.

// Capturing phase (занурення) — подія починається на window і тоне (проходить через усі елементи-предки) до найглибшого цільового елемента, на якому відбулася подія. На схемі подія — це клік, і capturing закінчується на елементі <button>.
// Target phase (таргетинг) — подія дійшла до цільового елемента. Цей етап містить тільки повідомлення елемента про те, що на ньому відбулася дія.
// Bubbling phase (спливання) — кінцева фаза, подія спливає від найглибшого, цільового елемента, через усі елементи-предки до window.

// Поширення подій часто неправильно використовується як синонім стадії спливання, але це лише частина всього процесу. Тому щоразу, коли відбувається подія, відбувається її поширення.
//#endregion

//#region Спливання подій

// Зараз ми зосередимося на фазі спливанні події, адже часто розробник працює саме зі спливанням.
// Під час настання події обробники спочатку спрацьовують на найбільш вкладеному елементі. Потім — на його батьківському елементі, потім — вище і так далі, вгору по ланцюжку вкладеності. Цей процес називається спливання (event bubbling), тому що події «спливають» від внутрішнього елемента вгору через усіх предків до window, подібно до спливання бульбашки повітря у воді.

//Розглянемо приклад: є три вкладені теги <div> з обробниками кліка на кожному з них.

{
  const parent = document.querySelector("#parent");
  const child = document.querySelector("#child");
  const descendant = document.querySelector("#descendant");

  parent.addEventListener("click", () => {
    console.log("Parent click handler");
  });

  child.addEventListener("click", () => {
    console.log("Child click handler");
  });

  descendant.addEventListener("click", () => {
    console.log("Descendant click handler");
  });
}

//#endregion
