// Інтернет і протоколи

//#region Протокол HTTP
/* 
Перед тим як користувач побачить вміст сайту на екрані, браузер робить запит на сервер, щоб отримати цей вміст. HTML-файл, зображення, стилі та скрипти — усе це приходить із сервера за HTTP протоколом. HTTP протокол, по суті, є набором правил і домовленостей, що використовуються при передачі даних у мережі. 

HyperText Transfer Protocol (протокол передачі гіпертексту) — поширений протокол для передачі вебресурсів різних типів: html, css, javascript, зображень, аудіо та відео тощо.

HTTP ґрунтується на структурі клієнт-сервер і моделі запит-відповідь. Як це працює?

Клієнтський застосунок ініціює з'єднання, формує запит і відправляє його на сервер.
Після чого сервер обробляє цей запит, формує відповідь і передає її назад клієнтові.
Зв'язок між ними здійснюється за допомогою низки перемежованих HTTP-запитів і HTTP-відповідей.

Запит відбувається в кілька етапів:

DNS-запит — пошук найближчого DNS-сервера, щоб перетворити адресу (наприклад google.com) в її числове вираження, IP-адресу (74.125.87.99).
З'єднання — встановлення з'єднання з сервером за отриманою IP-адресою.
Передача даних — пересилання пакетів з клієнта на сервер.
Очікування відповіді — очікування, доки пакети даних дійдуть до сервера, він їх обробить, і відповідь повернеться назад до клієнта.
Отримання даних — пакети надійшли, можна отримувати з них дані.
*/
//#endregion

//#region Протокол HTTPS
/* 
HyperText Transfer Protocol Secure — це налаштування над протоколом HTTP, у якому всі повідомлення між клієнтом і сервером шифруються з метою підвищення безпеки.

HTTPS протокол забезпечує захист від атак, що базуються на “прослуховуванні” з'єднання. Дані передаються з використанням криптографічних протоколів SSL або TLS.

Під час обміну через звичайне HTTP-з'єднання всі дані передаються у вигляді тексту і можуть бути прочитані всіма, хто отримав доступ до з'єднання між клієнтом і сервером. Якщо користувачі роблять покупки онлайн і заповнюють форму замовлення, що містить інформацію про кредитну картку, їхні фінансові дані набагато легше викрасти, якщо вони передаються у вигляді тексту. З HTTPS дані будуть зашифровані і хакер не зможе їх розшифрувати, тому що для розшифрування необхідний доступ до закритого ключа, який зберігається на сервері. 

Протокол HTTPS гарантує, що інформація про клієнта, наприклад номери кредитних карток, зашифрована і не може бути перехоплена в розшифрованому вигляді. Відвідувачі можуть переконатися, що сайт безпечний, подивившись на іконку зліва від адресного рядка, захищені з'єднання позначаються іконкою замка.
*/
//#endregion
