//#region AJAX
/* 
AJAX (Asynchronous JavaScript and XML) — це метод обміну даними між клієнтом і сервером без перезавантаження сторінки. Завдяки цьому вебсторінки стають інтерактивнішими і швидше реагують на дії користувача.

- Дозволяє динамічно оновлювати контент, не перезавантажуючи всю сторінку.
- Зменшує навантаження на сервер, оскільки оновлюються тільки необхідні частини інтерфейсу.
- Використовується в усіх сучасних вебзастосунках, від соцмереж до онлайн-магазинів. 










*/
//#endregion
