//Прототипи

//#region Прототип об'єкта

//Звідки беруться вбудовані методи масивів push, map, reduce та інші?
// Чому у функції є методи call і bind?
// Досі ми просто приймали, що вони є і ними можна користуватися. Прийшов час знайти відповіді на ці питання.

// Усе це можливо завдяки механізму прототипного успадкування, який дає змогу організувати об'єкти в ланцюжки таким чином, щоб здійснювався автоматичний пошук властивості в іншому об'єкті, якщо її не знайдено в поточному.

// Сполучною ланкою виступає спеціальна службова властивість [[Prototype]], яку ми не змінюємо явно, вона використовується для автоматичного зв'язку об'єктів.
// Метод Object.create(obj) створює і повертає новий об'єкт, зв'язуючи його з об'єктом obj. Розгляньмо приклад:
{
  const animal = {
    legs: 4,
  };

  const dog = Object.create(animal);
  dog.name = "Mango";

  console.log(dog); // { name: "Mango", [[Prototype]]: animal }

  console.log(dog.name); // "Mango"
  console.log(dog.legs); // 4
}

//Звернення dog.name працює очевидним чином: повертає властивість name об'єкта dog. Звертаючись до dog.legs, інтерпретатор шукає властивість legs в об'єкті dog, не знаходить і продовжує пошук в об'єкті за посиланням з [[Prototype]], тобто в цьому випадку в об'єкті animal — його прототипі.
// Отже, прототип — це резервне сховище властивостей і методів об'єкта, яке автоматично використовується під час їх пошуку.

{
  //Task
  // Зміни код таким чином, щоб об'єкт parent став прототипом для об'єкта у змінній сhild.
  {
    const parent = {
      name: "Stacey",
      surname: "Moore",
      age: 54,
      heritage: "Irish",
    };

    const child = Object.create(parent);
    child.name = "Jason";
    child.age = 27;

    console.log(parent); // { name: "Stacey", surname: "Moore", age: 54, heritage: "Irish" }
    console.log(child); // { name: "Jason", age: 27 }

    // 🔹 Перевірки властивостей
    console.log(parent.hasOwnProperty("surname")); // true
    console.log(parent.hasOwnProperty("heritage")); // true

    console.log(child.hasOwnProperty("name")); // true
    console.log(child.name); // "Jason"

    console.log(child.hasOwnProperty("age")); // true
    console.log(child.age); // 27

    console.log(child.hasOwnProperty("surname")); // false
    console.log(child.surname); // "Moore"

    console.log(child.hasOwnProperty("heritage")); // false
    console.log(child.heritage); // "Irish"

    console.log(parent.isPrototypeOf(child)); // true
  }
}
//#endregion

//#region Перевірка прототипу
// Якщо в коді потрібно перевірити, чи є об'єкт прототипом іншого об'єкта, використовується метод isPrototypeOf().
// Метод перевіряє, чи є об'єкт objA прототипом для об’єкта objB
// Якщо так, повертає true, в іншому разі повертає false

// Розгляньмо приклад використання методу isPrototypeOf() для перевірки належності прототипу.
{
  const customer = {
    username: "Jacob",
  };

  const animal = {
    legs: 4,
  };

  const dog = Object.create(animal);
  dog.name = "Mango";

  console.log(dog); // { name: "Mango", [[Prototype]]: animal }

  console.log(animal.isPrototypeOf(dog)); // true
  console.log(dog.isPrototypeOf(animal)); // false
  console.log(customer.isPrototypeOf(dog)); // false

  //у першому лозі виводиться об'єкт dog із властивістями name і [[Prototype]]. [[Prototype]] вказує на animal як прототип
  //у другому — повертається true, оскільки animal є прототипом для dog
  //у третьому — повертається false, оскільки прототип не успадковується у зворотному напрямку (від dog до animal)
  //у четвертому лозі повертається false, оскільки customer не є прототипом для dog
}
//#endregion

//#region Власні і невласні властивості
// Використаємо вже знайомий нам приклад створення об'єкта dog з прототипом animal.
{
  const animal = {
    legs: 4,
  };
  const dog = Object.create(animal);
  dog.name = "Mango";

  console.log(dog); // {name: "Mango", [[Prototype]]: animal}
  console.log(dog.name); // "Mango"
  console.log(dog.legs); // 4

  //Властивість name належить об'єкту dog, тому називається власною властивістю об'єкта dog.
  // Властивість legs не належить об'єкту dog. Це властивість його прототипу animal, тому вона називається невласною властивістю об'єкта dog.

  //Для того щоб перевірити, чи є в об'єкті власна властивість, використовується метод obj.hasOwnProperty(key). Цей метод перевіряє наявність власної властивості з ім'ям key і повертає true, якщо є, і false в іншому випадку.

  console.log(dog.hasOwnProperty("name")); // true
  console.log(dog.hasOwnProperty("legs")); // false
}

//#endregion

//region Перебір власних властивостей
{
  // Оператор in, який використовується в циклі for...in, не розрізняє власні властивості об'єкта і його прототипу. Ця особливість заважає, оскільки зазвичай потрібно перебрати тільки власні властивості.
  const animal = { legs: 4 };
  const dog = Object.create(animal);
  dog.name = "Mango";

  for (const key in dog) {
    console.log(key); // "name" "legs"
  }
}

{
  //Для вибору саме власних властивостей під час перебору циклом for...in необхідно на кожній ітерації додати перевірку на власну властивість методом obj.hasOwnProperty(key). Цей метод повертає true, якщо властивість з іменем key належить об'єкту obj, а не його прототипу, в іншому разі — false. Розгляньмо приклад:

  const animal = { legs: 4 };
  const dog = Object.create(animal);
  dog.name = "Mango";

  for (const key in dog) {
    if (dog.hasOwnProperty(key)) {
      console.log(key); // "name"
    }
  }
  //Якщо це власна властивість — виконуємо тіло if
  //Якщо це невласна властивість — нічого не робимо
}

{
  //Методи Object.keys(obj) і Object.values(obj) повертають масив тільки власних ключів або значень тільки власних властивостей об'єкта obj, без необхідності додаткових перевірок. Через це на практиці використовують саме їх із циклом for...of, замість for...in і hasOwnProperty.

  const animal = { legs: 4 };
  const dog = Object.create(animal);
  dog.name = "Mango";

  console.log(Object.keys(dog)); // ["name"]
  console.log(Object.values(dog)); // ["Mango"]

  for (const key of Object.keys(dog)) {
    console.log(key); // "name"
  }
}
//#endregion

//#region Ланцюжки прототипів
{
  // Об'єкт, який виступає прототипом для іншого об'єкта, також може мати свій прототип. Отже, існують ланцюжки прототипів.Давайте реалізуємо це в коді. Ланцюжок прототипів будується з кінця, тобто справа наліво.

  const objC = { c: "objC prop" };

  const objB = Object.create(objC);
  objB.b = "objB prop";

  const objA = Object.create(objB);
  objA.a = "objA prop";

  console.log(objA); // { a: "objA prop", [[Prototype]]: objB }
  console.log(objB); // { b: "objB prop", [[Prototype]]: objC }
  console.log(objC); // { c: "objC prop", [[Prototype]]: Object }

  //Оскільки об’єкти objA, objB і objC пов'язані в ланцюжок прототипів, об'єкт objA може отримати доступ до властивостей objB і objC, а об'єкт objB — до властивостей objC.

  console.log(objA.hasOwnProperty("a")); // true
  console.log(objA.a); // "objA prop"

  console.log(objA.hasOwnProperty("b")); // false
  console.log(objA.b); // "objB prop"

  console.log(objA.hasOwnProperty("c")); // false
  console.log(objA.c); // "objC prop"

  console.log(objA.hasOwnProperty("x")); // false
  console.log(objA.x); // undefined

  //Пошук властивостей відбувається до першого збігу. Інтерпретатор шукає властивість за ім'ям в об'єкті:
  // Якщо інтерпретатор не знаходить власну властивість, то звертається до властивості [[Prototype]], тобто переходить за посиланням до об'єкта-прототипу, а потім — до прототипу прототипу за ланцюжком.
  // Якщо інтерпретатор доходить до кінця ланцюжка і не знаходить властивості з таким ім'ям, то повертається undefined.
}

//Task
{
  // Зміни код, побудувавши ланцюжок прототипів таким чином, щоб об'єкт ancestor був прототипом для parent, а той, своєю чергою, був прототипом для child.

  const ancestor = {
    name: "Paul",
    age: 83,
    surname: "Dawson",
    heritage: "Irish",
  };

  const parent = Object.create(ancestor);
  parent.name = "Stacey";
  parent.surname = "Moore";
  parent.age = 54;

  const child = Object.create(parent);
  child.name = "Jason";
  child.age = 27;

  console.log(ancestor.hasOwnProperty("surname")); // true
  console.log(ancestor.surname); // "Dawson"

  console.log(parent.hasOwnProperty("surname")); // true
  console.log(parent.surname); // "Moore"

  console.log(child.hasOwnProperty("surname")); // false
  console.log(child.surname); // "Moore"

  console.log(ancestor.hasOwnProperty("heritage")); // true
  console.log(ancestor.heritage); // "Irish"

  console.log(parent.hasOwnProperty("heritage")); // false
  console.log(parent.heritage); // "Irish"

  console.log(child.hasOwnProperty("heritage")); // false
  console.log(child.heritage); // "Irish"

  console.log(Object.create !== undefined); // Використовується метод Object.create()
}

//#endregion

//#region Кінець ланцюжка прототипів
// Давай створимо ланцюжок прототипів із двох об'єктів.
{
  const objB = {
    b: "objB prop",
  };

  const objA = Object.create(objB);
  objA.a = "objA prop";

  console.log(objA);
}

//Отже, objB — це прототип для об'єкта objA. Розгорнувши вміст ланцюжка прототипів у консолі розробника, ми побачимо таку картину.

// Ти вже знаєш, що у властивості [[Prototype]] об'єкта objA лежить посилання на об'єкт objB. А що знаходиться у властивості [[Prototype]] об'єкта objB?

// Наприкінці ланцюжка прототипів завжди знаходиться посилання на базовий клас, від якого походить тип даних у ланцюжку. У нашому випадку objB — це об'єкт, тому в кінці ланцюжка буде посилання на клас Object.

//#endregion
