//ООП
// У чому різниця між хорошим і поганим кодом?

// Досі головним критерієм було: хороший код працює без помилок, а поганий — ні. Але на практиці все складніше. Сучасний продукт рідко має кодову базу, меншу за 100 000 рядків. Те, що він працює — це добре, але недостатньо.

// Важливі також такі критерії:

// Надійність — навіть дуже об'ємне і складне ПЗ має працювати стабільно.
// Масштабованість — можливість легко адаптувати ПЗ до зростаючого навантаження.
// Адаптивність — продукт має бути гнучким, щоб швидко міняти функціонал/інтерфейс.
// Вартість — зниження витрат на розробку і збільшення ефективності важливі для успішної конкуренції на ринку.

// Для створення коду, який задовольнятиме ці вимоги, потрібен або величезний практичний досвід (що не завжди можливо), або знання принципів створення правильного коду. Отже, розгляньмо основні парадигми програмування та порівняємо їхні сильні та слабкі сторони.

//#region Процедурне програмування
// Процедурне програмування — це парадигма програмування, у якій програми структуровані у вигляді набору функцій, які виконують певні дії над даними.

// Основні концепції процедурного програмування включають:

// Процедури (функції): Основною одиницею програми є функції. Вони призначені для виконання конкретних завдань. Функції приймають аргументи (вхідні дані), обробляють їх і можуть повертати результат (вихідні дані).
// Локальні та глобальні змінні: Змінні, що оголошуються в межах функції, є локальними й доступними лише в цій функції. Змінні, оголошені поза функціями, є глобальними й доступними в усій програмі.

// Процедурний код — це набір не пов'язаних явно функцій і змінних для зберігання й обробки інформації.

{
  //Цей підхід — простий і прямолінійний. Він може використовуватись для задач, в яких немає тісно пов'язаних сутностей (даних і функцій для їх обробки).Розгляньмо приклад процедурного коду, в якому є глобальні змінні і функція для підрахунку результату.

  const baseSalary = 30000;
  const overtime = 10;
  const rate = 20;

  const getWage = (baseSalary, overtime, rate) => {
    return baseSalary + overtime * rate;
  };

  getWage(baseSalary, overtime, rate); //виклик функції
  console.log(getWage(baseSalary, overtime, rate)); //виведення результату 30200
}

//Процедурне програмування — це те, як ми з тобою писали код до сих пір. Воно є простим і зрозумілим і може бути використане для написання простих програм. Проте зі збільшенням складності програми процедурний підхід може стати неефективним, оскільки втрачається зв'язок між даними й методами їх обробки.

//#endregion

//#region Об'єктно-орієнтоване програмування
// Об'єктно-орієнтоване програмування (ООП) — це парадигма програмування, в якій програми структуровані як сукупність об'єктів. Ці об’єкти представляють реальні або абстрактні сутності: користувач, магазин, автомобіль тощо. Кожен з об’єктів містить дані (властивості) і методи для взаємодії з ними.

{
  //Перепишемо код із попереднього прикладу із застосуванням ООП.Для цього об'єднаємо дані та функцію їх обробки в об'єкт employee.

  const employee = {
    baseSalary: 30000,
    overtime: 10,
    rate: 20,
    getWage() {
      return this.baseSalary + this.overtime * this.rate;
    },
  };

  employee.getWage(); //виклик функції
  console.log(employee.getWage()); //виведення результату 30200
}

//При такому підході відсутні або майже відсутні глобальні змінні. Методи не залежать від параметрів, а використовують властивості об'єкта, які задаються при його створенні і можуть бути змінені іншими методами.

//Програмування в стилі ООП допомагає структурувати код, полегшує його розробку та підтримку і дозволяє створювати більш складні програми, організовані навколо об'єктів та їх взаємодії.

//#endregion

//#region Клас
//Для розуміння основних концепцій об'єктно-орієнтованого програмування важливо володіти основними термінами. Найпростіше буде розібрати їх через проведення аналогії з чимось із реального світу.

// Уявімо, що ми проєктуємо автомобіль. Про що варто подумати заздалегідь?
// У нього буде двигун, чотири колеса, бензобак та інші запчастини. Автомобіль повинен виконувати певні дії: заводитися, збільшувати і зменшувати швидкість тощо. Ми також маємо знати, як працює двигун і колеса, тобто за якими законами взаємодіють різні частини машини.

//У проєкті треба описати:

//всі запчастини, з яких складається автомобіль
//яким чином ці запчастини взаємодіють між собою
//що повинен зробити водій, щоб автомобіль загальмував, увімкнулися фари тощо.

//Результатом нашої роботи буде один певний ескіз (шаблон, схема, кліше), на основі якого в подальшому буде створюватися необмежена кількість автомобілів. Ми тільки що розробили те, що в ООП називається класом.
// Клас — це спосіб опису сутності, що визначає структуру та поведінку об'єктів, а також правила для взаємодії з цією сутністю (контракт). Вони виступають в якості шаблонів для створення нових об'єктів.

//У нашому прикладі клас визначає сутність: автомобіль.
//Властивостями класу будуть запчастини: двигун, колеса, фари тощо.
//Методами класу будуть дії: відчинити двері, завести двигун, збільшити швидкість тощо.

//#endregion

//#region Екземпляр класу
//У прикладі з попереднього розділу ми зупинилися на створенні певного ескізу (шаблону, схеми). Автомобілі, розроблені за цими ескізами, сходять з конвеєра. Кожен з них точно повторює креслення: усі системи взаємодіють саме так, як було спроєктовано. При цьому кожен автомобіль унікальний. Усі автомобілі мають номер кузова і двигуна, але їхні номери різні. Автомобілі також розрізняються за кольором, оздобленням салону.
// Ці автомобілі — це екземпляри класу.

// Екземпляр (об'єкт, інстанція) — це окремий представник класу, який має дані (властивості) і методи (функції), які працюють з цими даними. Екземпляр — це те, що створено за кресленням, тобто на підставі опису з класу.Іншими словами, об'єкт має конкретні значення властивостей і методи, що працюють з цими властивостями на основі правил, заданих у класі. У прикладі з автомобілями:
// Клас — це якийсь абстрактний автомобіль на кресленні
// Екземпляр (об'єкт) — це конкретний автомобіль, що стоїть у нас під вікнами

//#endregion

//#region Інтерфейс класу
// Сідаючи за кермо автомобіля, ми бачимо певний набір елементів управління, з якими можна взаємодіяти.
// Інтерфейс — це набір властивостей і методів класу, доступних для використання у роботі з екземпляром.
// По суті, інтерфейс описує клас, чітко визначаючи всі можливі дії над ним.

// Гарний приклад інтерфейсу — панель приладів автомобіля, яка дозволяє викликати методи, наприклад, збільшення швидкості, гальмування, повороти, перемикання передач, увімкнення фар тощо.
// Описуючи інтерфейс класу, дуже важливо витримати баланс між гнучкістю й простотою.

//Клас із простим інтерфейсом легко використовувати, але будуть існувати завдання, які за допомогою нього буде складно вирішити.

// Якщо інтерфейс буде гнучким, то, найімовірніше, він буде містити досить складні методи з великою кількістю параметрів. Такий інтерфейс дозволить виконувати дуже багато дій, але його використання буде пов'язане з труднощами й ризиком помилитися, переплутавши щось.

//#endregion
