//#region Псевдомасив arguments

// Доступ до списку всіх аргументів можна отримати за допомогою спеціальної змінної arguments. Коли ти викликаєш функцію з аргументами, arguments автоматично створюється всередині цієї функції і заповнюється переданими значеннями аргументів.
{
  function sum(a, b) {
    console.log(arguments);
    return a + b;
  }

  sum(2, 5);
}

//Розгляньмо приклад використання arguments у функції, яка повертає результат множення будь-якої кількості аргументів.
{
  function multiply() {
    let total = 1;

    for (const arg of arguments) {
      total *= arg;
    }

    return total;
  }

  console.log(multiply(1, 2, 3)); //  6
  console.log(multiply(1, 2, 3, 4)); //  24
  console.log(multiply(1, 2, 3, 4, 5)); //  120
}

//Якщо під час роботи з arguments потрібно використовувати методи масиву, тоді псевдомасив необхідно перетворити на масив, використовуючи метод Array.from(), який створить масив із псевдомасиву.
{
  function foo() {
    // У змінній args буде повноцінний масив з усіх аргументів
    const args = Array.from(arguments);
    return args.join("-");
  }

  foo(1, 2, 3); // Поверне "1-2-3"
}

//Приклад-функція
// Функція createReversedArray() може приймати довільну кількість аргументів. Доповни код функції так, щоб вона повертала масив усіх аргументів, але в масиві вони повинні йти у зворотному порядку. Тобто, при виклику createReversedArray(1, 2, 3), функція має повернути масив [3, 2, 1]. Використовуй цикл або метод масиву toReversed(), який застосовується до масиву і результатом роботи повертає новий масив з елементами у зворотньому порядку.
{
  function createReversedArray() {
    const args = Array.from(arguments);
    return args.toReversed();
  }

  console.log(createReversedArray(12, 85, 37, 4)); //
  console.log(createReversedArray(164, 48, 291)); //
  console.log(createReversedArray(412, 371, 94, 63, 176)); //
  console.log(createReversedArray()); //
}
//#endregion

//#region Параметри за замовчуванням
// Функції можуть мати параметри зі значеннями за замовчуванням, тобто необов'язкові параметри. Ці значення використовуються в тому випадку, якщо функція викликається без передавання відповідного аргументу для цього параметра. Значенням за замовчуванням може бути будь-який тип даних.

{
  function greet(username = "Guest") {
    console.log(`Hello, ${username}!`);
  }

  greet("Jacob"); // "Hello, Jacob!"
  greet("rgsdrgsrg"); // "Hello, rgsdrgsrg"
  greet(); // "Hello, Guest!
  greet(); // "Hello, Guest!"
}

//У цьому прикладі функція greet має параметр username, який має значення за замовчуванням "Guest". Якщо аргумент не передано під час виклику функції, буде використано значення "Guest". Якщо передано аргумент, цей аргумент замінить значення за замовчуванням.

//Приклад із кількома параметрами.
{
  function count(from, to, step = 1) {
    console.log(`from: ${from}, to: ${to}, step: ${step}`);

    for (let i = from; i <= to; i += step) {
      // ...
    }
  }

  count(1, 15, 4); // "from: 1, to: 15, step: 4"
  count(1, 15); // "from: 1, to: 15, step: 1"
}

//🔍 3. Приклад, якщо додати return
{
  function count(from, to, step = 1) {
    let result = [];
    for (let i = from; i <= to; i += step) {
      result.push(i);
    }
    return result;
  }

  console.log(count(1, 15, 4)); // [1, 5, 9, 13]
}

//Приклад-функція
// Функція calculateTax(amount, taxRate) оголошує два параметри:
// amount - число, сума від якої потрібно обчислити податок. Обов'язковий параметр.
// taxRate - число, податкова ставка. Необов'язковий параметр. За замовчуванням його значення має бути 0.2.

// Доповни код функції так, щоб вона повертала суму податку - результат множення суми на податкову ставку.

{
  function calculateTax(amount, taxRate = 0.2) {
    let tax = amount * taxRate;

    return tax;
  }

  console.log(calculateTax(100, 0.1)); // 10
  console.log(calculateTax(200, 0.1)); // 20
  console.log(calculateTax(100, 0.2)); // 20
  console.log(calculateTax(200, 0.2)); // 40
  console.log(calculateTax(100)); // 20
  console.log(calculateTax(200)); // 40
}

//#endregion

//#region Функціональний вираз (Function Expression)
// Функціональний вираз (function expression) — звичайне оголошення змінної, значенням якої буде функція. Це альтернативний спосіб оголошення функції.

// Синтаксис оголошення функції, який ти вже знаєш (function declaration):
{
  function multiply(x, y, z) {
    console.log(x * y * z);
  }
}

//Синтаксис функціонального виразу (function expression):
{
  const multiply = function (x, y, z) {
    console.log(x * y * z);
  };
}

//Різниця в тому, що функціональний вираз (function expression) не можна викликати до місця його створення, тільки після, тому що це буквально оголошення const змінної.

{
  // ❌ Помилка! Не працює виклик до оголошення
  multiply(1, 2, 3);

  const multiply = function (x, y, z) {
    console.log(x * y * z);
  };

  // ✅ Працює виклик після оголошення
  multiply(4, 5, 6);
}

//A оголошення функції (function declaration) можна викликати до місця її створення в коді.
{
  // ✅ Працює виклик перед оголошенням
  multiply(1, 2, 3);

  function multiply(x, y, z) {
    console.log(x * y * z);
  }

  // ✅ Працює виклик після оголошення
  multiply(4, 5, 6);
}

//Не важливо, який синтаксис використовувати, головне, щоб код у проєкті був однорідним. Тобто необхідно намагатися не змішувати оголошення функції (function declaration) з функціональними виразами (function expression), щоб писати більш стандартизований зрозумілий код.

//#endregion

//#region Область видимості (Scopes)
// Область видимості (scope) — механізм, який визначає доступність змінних у коді, що виконується.
// Ланцюжок областей видимості (scope chain) — області видимості утворюють ієрархію, так що дочірні області мають доступ до змінних із батьківських областей, але не навпаки.
// Змінна видима для виконуваного коду, якщо вона є:
// в поточній області видимості або в ланцюжку областей видимості.

// Змінні, оголошені на найвищому рівні, тобто поза будь-якими конструкціями наприклад: if, for і функцій — перебувають у глобальній області видимості і доступні скрізь після їхнього оголошення.

{
  const globalValue = 10;

  console.log(globalValue); // 10

  function foo() {
    console.log(globalValue); // 10
  }

  for (let i = 0; i < 5; i += 1) {
    console.log(globalValue); // 10

    if (i === 2) {
      console.log(globalValue); // 10
    }
  }
}

//Змінні, оголошені всередині інструкційif, for, функцій та інших блоків коду, що огорнуті фігурними дужками {}, перебувають у блоковій області видимості та доступні тільки всередині цього блоку коду або вкладених у нього.
{
  function foo() {
    const a = 20;
    console.log(a); // 20

    for (let i = 0; i < 5; i += 1) {
      console.log(a); // 20

      if (i === 2) {
        console.log(a); // 20
      }
    }
  }

  // ❌ Помилка! Змінна a не доступна в цій області видимості
  console.log(a);

  for (let i = 0; i < 3; i += 1) {
    // ❌ Помилка! Змінна a не доступна в цій області видимості
    console.log(a);
  }
}

//Це можна уявити як будинок із кімнатами.
// Будинок знаходиться в глобальній області видимості. Кожна функція і блок створюють нову кімнату, вкладену всередину будинку. Змінні, оголошені всередині цих кімнат, доступні тільки тоді, коли ви перебуваєте всередині цієї кімнати. Поза кімнатою ці змінні недоступні.

{
  for (let i = 0; i < 5; i += 1) {
    const a = 20;
    console.log(a); // 20

    if (i === 2) {
      const b = 30;
      console.log(a); // 20
      console.log(b); // 30
    }

    if (i === 3) {
      console.log(a); // 20

      // ❌ Помилка! Змінна b не доступна в цій області видимості
      console.log(b);
    }
  }
}

//Інтерпретатор намагається спочатку знайти змінну в тій області видимості, в якій до неї звернулися.
// Якщо такої змінної в локальній області видимості немає, то він виходить назовні, на один рівень за спробу, доки не знайде значення або не дійде до самої верхньої області видимості (глобальної) і зрозуміє, що змінну з таким ідентифікатором неможливо знайти, тому що її просто немає, тоді буде помилка про те, що змінна не оголошена.

// Зверни увагу, що існують глобальні змінні, ім’я яких уже зарезервовано, наприклад, name. Тому якщо у тебе в коді є однойменна змінна з глобальною, то треба дуже уважно слідкувати за областями видимості, у яких ця змінна використовується. Наприклад:

{
  {
    const name = "Mango";
    console.log(name); // "Mango"
  }
  console.log(name); // значення глобальної змінної name. Помилки в консолі не буде
}
//#endregion

//#region Стек викликів
// Під час виклику функції всередині її тіла можуть викликатися інші функції, а в них інші тощо.
// JavaScript — однопотокова мова, тобто в одну одиницю часу може виконуватися тільки одна інструкція. Це означає, що вже викликані функції, які не закінчили своє виконання, повинні чекати виконання функцій, викликаних усередині себе, для того щоб продовжити свою роботу.
{
  function fnA() {
    console.log("Log inside fnA function before calling fnB");
    fnB();
    console.log("Log inside fnA function after fnB call");
  }

  function fnB() {
    console.log("Log inside fnB function");
  }

  console.log("Log before calling fnA");
  fnA();
  console.log("Log after calling fnA");

  // "Log before calling fnA"
  // "Log inside fnA function before calling fnB"
  // "Log inside fnB function"
  // "Log inside fnA function after fnB call"
  // "Log after calling fnA"
}

//Щоб код працював контрольовано й очікувано, потрібен механізм зберігання списку функцій, які були викликані, але ще не закінчили своє виконання, і механізм управління послідовністю виконання цих функцій. Саме за це й відповідає стек викликів (call stack).

// Стек — структура даних, яка працює за принципом LIFO (Last-In-First-Out), тобто останнім прийшов — першим вийшов. Останнє, що додається на стек, буде видалено з нього першим, значить, можна додати або видалити елементи тільки з верхівки стека. Уяви стек як масив, у якого можна додати або видалити тільки елемент у кінці колекції.

// Стек викликів (call stack) — це структура даних, яка допомагає інтерпретатору відстежувати послідовність і стан викликів функцій у програмі. Він показує, яка функція зараз виконується і яка буде викликана наступною.

// Коли в коді викликається функція, інтерпретатор додає її в стек викликів і починає виконання.
// Будь-які функції, викликані виконуваною функцією, додаються до стеку викликів і виконуються, щойно відбувається їхній виклик.
// Коли виконання функції завершено, інтерпретатор знімає її зі стеку викликів і відновлює виконання коду з тієї точки, де зупинився до цього. Тобто починає виконуватися функція, запис якої лежить наступною на стеку.

// Stack frame (кадр стека, запис стека) — структура, яка додається на стек при виклику функції. Зберігає службову інформацію, наприклад ім'я функції та номер рядка, у якому стався виклик.
{
  function bar() {
    console.log("bar");
  }

  function baz() {
    console.log("baz");
  }

  function foo() {
    console.log("foo");
    bar();
    baz();
  }

  foo();
}

//Під час виконання цього коду спочатку викликається foo(), потім всередині foo() викликається bar(), а потім baz(). Виклики console.log() так само враховуються, адже це функція. На ілюстрації нижче покроково зображено стек викликів для прикладу.

// Стек викликів не безмежний, йому відводиться кінцевий обсяг пам'яті. Іноді в консолі можна побачити помилку "Uncaught RangeError: Maximum call stack size exceeded" — переповнення стека (stack overflow).
// Це може статися при зациклюванні викликів функцій, тобто якщо йдуть нескінченні виклики функцій і результат не повертається, то стек збільшується. Наприклад, якщо функція викликає сама себе, що називається рекурсією. По досягненню межі кількості записів стека і виникне така помилка, і скрипт "падає".

//#endregion
