//#region Ітерація по масиву
// Ітерація по масиву з використанням циклу for дозволяє перебрати елементи масиву і виконати певну дію для кожного елемента.

// У прикладі нижче масив planets містить назви планет, і цикл for використовується для виведення кожного елемента в консоль.

{
  const planets = ["Earth", "Mars", "Venus"];

  for (let i = 0; i < planets.length; i += 1) {
    console.log(planets[i]);
  }
}
//Початкове значення лічильника i встановлюється як 0 і цикл продовжується, поки i менше за довжину масиву planets.length
//На кожній ітерації циклу використовується planets[i] для доступу до елементів масиву за їх індексом i
//Значення лічильника i з кожною ітерацією збільшується на 1 (вираз i += 1)
//Умова i < planets.length буде повертати true для значень лічильника 0, 1 і 2. Коли i досягне значення 3, умова стане false і цикл зупиниться

//Таким чином, на кожній ітерації циклу буде виконуватися блок коду всередині фігурних дужок, де ми виводимо поточний елемент масиву planets[i] в консоль. Результатом роботи циклу буде виведення назв планет одна за одною.

//Приклад-задача
// Функція calculateTotalPrice(order) приймає один параметр order - масив чисел. Доповни функцію так, щоб вона повертала загальну суму елементів з масиву order.

{
  function calculateTotalPrice(order) {
    let sum = 0; // змінна для збереження загальної суми
    for (let i = 0; i < order.length; i += 1) {
      sum += order[i];
    }
    return sum;
  }

  console.log(calculateTotalPrice([12, 85, 37, 4]));
  console.log(calculateTotalPrice([164, 48, 291]));
  console.log(calculateTotalPrice([412, 371, 94, 63, 176]));
}

//Приклад-задача
// Функція getEvenNumbers(start, end) має два параметри start та end, які є цілими числами. Доповни код функції так, щоб вона повертала масив усіх парних чисел від start до end. Якщо жодного парного числа немає, то масив має бути пустим.
// Парним вважається число, яке ділиться на 2 без остачі (10 % 2 === 0). Використовуй цикл for.

{
  function getEvenNumbers(start, end) {
    const numbers = [];
    for (let i = start; i <= end; i += 1) {
      if (i % 2 === 0) {
        // перевіряємо, чи число парне
        numbers.push(i); // додаємо парне число в масив
      }
    }
    return numbers;
  }

  console.log(getEvenNumbers(2, 5)); //
  console.log(getEvenNumbers(3, 11)); //
  console.log(getEvenNumbers(8, 8)); //
  console.log(getEvenNumbers(6, 12)); //
}

//#endregion
