//Цикли
//#region Цикл while - використовується для повторення блоку коду, поки умова є істинною.
// Цикл while — це цикл з передумовою, тобто він виконується доки істинна певна умова, зазначена перед його початком. Цю умову перевіряють до виконання тіла циклу, тому тіло може бути не виконано жодного разу, якщо умова від самого початку хибна.
{
  let count = 0;

  while (count < 10) {
    console.log(`Count: ${count}`);
    count += 1;
  }
}

//Задача: Реєстрація у готелі
// Змінна clientCounter зберігає кількість зайнятих номерів на поточний момент.
// Змінна maxClients зберігає загальну кількість номерів у готелі.
// Завдяки циклу while місця в готелі будуть заповнюватися доти, доки поточна кількість клієнтів не дорівнюватиме максимально допустимій.
{
  let clientCounter = 18;
  const maxClients = 25;

  while (clientCounter < maxClients) {
    console.log(clientCounter);
    clientCounter += 1;
  }
}
